# MacroLanguageType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModuleSettings..::..MacroLanguageType Property
ModuleSettings Class See Also
---
The Macro language type.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MacroLanguageType MacroLanguageType { get; set; }
```

Visual Basic
---
```text
Public Property MacroLanguageType As MacroLanguageType
	Get
	Set
```

Visual C++
---
```text
public:
property MacroLanguageType MacroLanguageType {
	MacroLanguageType get ();
	void set (MacroLanguageType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ModuleSettings Class
Autodesk.Revit.DB.Macros Namespace